src/Reports/ОтчетПоНормированиюSMD_Установка/ОтчетПоНормированиюSMD_Установка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоНормированиюSMD_Установка</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ВыполнениеЭтаповПроизводства/ВыполнениеЭтаповПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеЭтаповПроизводства</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МТК</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыSMD/НормыSMD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыSMD</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаНормоЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПередачаНаЛинейку/ПередачаНаЛинейку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаНаЛинейку</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиНаЛинейки</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Reports/ОтчетПоНормированиюSMD_Установка/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьЛиниюSMD(МТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.ЛинияSMD
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование = &МТК";
Запрос.УстановитьПараметр("МТК", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.ЛинияSMD);
	КонецЦикла;
Возврат(Справочники.ЛинииSMD.ПустаяСсылка());
КонецФункции

&НаСервере
Функция ПолучитьДатуПередачиНаЛинейку(МТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачаНаЛинейку.Дата
	|ИЗ
	|	Документ.ПередачаНаЛинейку КАК ПередачаНаЛинейку
	|ГДЕ
	|	ПередачаНаЛинейку.ДокументОснование = &МТК";
Запрос.УстановитьПараметр("МТК", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТаблицаПЗ.Очистить();
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	Макет = ОбъектЗн.ПолучитьМакет("МакетДляДокумента");
	Иначе
	Макет = ОбъектЗн.ПолучитьМакет("Макет");
	КонецЕсли;
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.ДатаОкончания;
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ОблШапка.Параметры.ВидДокумента = ТипЗнч(ЭтаФорма.Параметры.Документ);
	ОблШапка.Параметры.Подразделение = ЭтаФорма.Параметры.Документ.Подразделение;
	ОблШапка.Параметры.Комментарий = ЭтаФорма.Параметры.Документ.Комментарий;
	КонецЕсли;
ТабДок.Вывести(ОблШапка);

СписокМТК = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыполнениеЭтаповПроизводства.МТК,
	|	ВыполнениеЭтаповПроизводства.Спецификация,
	|	ВыполнениеЭтаповПроизводства.Исполнитель,
	|	ВыполнениеЭтаповПроизводства.Количество,
	|	ВыполнениеЭтаповПроизводства.Период
	|ИЗ
	|	РегистрСведений.ВыполнениеЭтаповПроизводства КАК ВыполнениеЭтаповПроизводства
	|ГДЕ
	|	ВыполнениеЭтаповПроизводства.МТК.Линейка В(&СписокЛинеек)
	|	И ВыполнениеЭтаповПроизводства.Период МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И ВыполнениеЭтаповПроизводства.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	КонецЕсли; 
Запрос.УстановитьПараметр("ДатаНач", Отчет.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ЛинияSMD = ПолучитьЛиниюSMD(ВыборкаДетальныеЗаписи.МТК);
		Если СписокЛинийSMD.Количество() > 0 Тогда
			Если СписокЛинийSMD.НайтиПоЗначению(ЛинияSMD) = Неопределено Тогда
			Продолжить;			
			КонецЕсли;
		КонецЕсли;
	ТЧ = ТаблицаПЗ.Добавить();
	ТЧ.МТК = ВыборкаДетальныеЗаписи.МТК;
	ТЧ.Изделие = ВыборкаДетальныеЗаписи.МТК.Номенклатура;
	ТЧ.ЭтапСпецификации = ВыборкаДетальныеЗаписи.Спецификация;
	ТЧ.Исполнитель = ВыборкаДетальныеЗаписи.Исполнитель;
	ТЧ.ДатаВыполнения = ВыборкаДетальныеЗаписи.Период;
	ТЧ.КоличествоИзгот = ВыборкаДетальныеЗаписи.Количество;
	ТЧ.ЛинияSMD = ЛинияSMD;
	ТЧ.ДатаВыпуска = ПолучитьДатуПередачиНаЛинейку(ВыборкаДетальныеЗаписи.МТК);
	КонецЦикла;
		Если СортироватьПо = 1 Тогда
		ТаблицаПЗ.Сортировать("МТК,Изделие,Исполнитель");
		ИначеЕсли СортироватьПо = 2 Тогда
		ТаблицаПЗ.Сортировать("Изделие,МТК,Исполнитель");
		ИначеЕсли СортироватьПо = 3 Тогда	
		ТаблицаПЗ.Сортировать("Исполнитель,МТК,Изделие");
		ИначеЕсли СортироватьПо = 4 Тогда	
		ТаблицаПЗ.Сортировать("ДатаВыполнения,МТК,Изделие");
		ИначеЕсли СортироватьПо = 5 Тогда	
		ТаблицаПЗ.Сортировать("ДатаВыпуска,МТК,Изделие");
		КонецЕсли;
НомСтр = 0;
КолИзготВсего = 0;
СтоимостьИтогоВсего = 0;
	Для каждого ТЧ Из ТаблицаПЗ Цикл
	НомСтр = НомСтр + 1;
	ОблСтрока.Параметры.НомСтр = НомСтр;
	ОблСтрока.Параметры.Исполнитель = ТЧ.Исполнитель;
	ОблСтрока.Параметры.Линейка = ТЧ.МТК.Линейка;
	ОблСтрока.Параметры.Линия = ТЧ.ЛинияSMD;
	ОблСтрока.Параметры.НомерМТК = ТЧ.МТК.Номер;
	ОблСтрока.Параметры.МТК = ТЧ.МТК;
	ОблСтрока.Параметры.Статус = ПолучитьСтатус(ТЧ.ЭтапСпецификации);
	ОблСтрока.Параметры.НаименованиеИзделия = СокрЛП(ТЧ.Изделие.Наименование);
	ОблСтрока.Параметры.Изделие = ТЧ.Изделие;
	ОблСтрока.Параметры.НаименованиеСпецификации = СокрЛП(ТЧ.ЭтапСпецификации.Наименование);
	ОблСтрока.Параметры.ЭтапСпецификации = ТЧ.ЭтапСпецификации;
	ОблСтрока.Параметры.ДатаВыполнения = Формат(ТЧ.ДатаВыполнения,"ДФ=dd.MM.yyyy");
	ОблСтрока.Параметры.ДатаВыпуска = Формат(ТЧ.ДатаВыпуска,"ДФ=dd.MM.yyyy");
	ОблСтрока.Параметры.КолМТК = ТЧ.МТК.Количество;
	ОблСтрока.Параметры.КолИзгот = ТЧ.КоличествоИзгот;
	НормыSMD = РегистрыСведений.НормыSMD.ПолучитьПоследнее(ТЧ.ДатаВыполнения,Новый Структура("МПЗ,ЛинияSMD",ТЧ.ЭтапСпецификации,ТЧ.ЛинияSMD));
	ОблСтрока.Параметры.НВ = НормыSMD.НормаВремени;
	ОблСтрока.Параметры.НЧ = НормыSMD.ЦенаНормоЧаса;
	ОблСтрока.Параметры.ВремяИзгот = ТЧ.КоличествоИзгот*НормыSMD.НормаВремени;
	ОблСтрока.Параметры.Куп = 1;
	Стоимость = ТЧ.КоличествоИзгот*НормыSMD.ЦенаНормоЧаса;
	ОблСтрока.Параметры.Стоимость = Формат(Стоимость,"ЧЦ=9; ЧДЦ=2");
	ОблСтрока.Параметры.Кр = ТЧ.Исполнитель.Должность.КоэффициентРазряда;
	СтоимостьИтого = Стоимость*ОблСтрока.Параметры.Кр;
	ОблСтрока.Параметры.СтоимостьИтого = Формат(СтоимостьИтого,"ЧЦ=9; ЧДЦ=2");
	КолИзготВсего = КолИзготВсего + ТЧ.КоличествоИзгот;
	СтоимостьИтогоВсего = СтоимостьИтогоВсего + СтоимостьИтого;
	ТекОбл = ТабДок.Вывести(ОблСтрока);
		Если НормыSMD.ЦенаНормоЧаса = 0 Тогда
		ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, ТекОбл.Право).ЦветФона = WebЦвета.Коралловый;
		КонецЕсли; 
	КонецЦикла;
ОблКонец.Параметры.КолИзготВсего = КолИзготВсего;
ОблКонец.Параметры.СтоимостьИтогоВсего = Формат(СтоимостьИтогоВсего,"ЧЦ=9; ЧДЦ=2");
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ОблКонец.Параметры.Мастер = ЭтаФорма.Параметры.Документ.Автор;
	ОблКонец.Параметры.ЗаместительНачальникаПоУправлениюРесурсами = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Заместитель начальника по управлению ресурсами");
	ОблКонец.Параметры.НачальникПЭО = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Начальник ПЭО");
	КонецЕсли;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ОбщийМодульВызовСервера.РазрешенныйСписокЛинеек(СписокЛинеек) Тогда
		СформироватьНаСервере();		
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("Исполнитель") Тогда
	Исполнитель = ЭтаФорма.Параметры.Исполнитель;
	Элементы.Исполнитель.Доступность = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметрыДокумента(Документ)
Отчет.ДатаНачала = НачалоМесяца(Документ.Дата)+25200;			
Отчет.ДатаОкончания = КонецМесяца(Документ.Дата)+25200;
СписокЛинеек.Очистить();
	Если Документ.Линейка.ЭтоГруппа Тогда
	Линейки = Справочники.Линейки.Выбрать(Документ.Линейка);
		Пока Линейки.Следующий() Цикл
			Если Линейки.Проектная = Документ.Проектные Тогда
			СписокЛинеек.Добавить(Линейки.Ссылка);
			КонецЕсли;			
		КонецЦикла;	
	Иначе	
	СписокЛинеек.Добавить(Документ.Линейка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ПолучитьПараметрыДокумента(ЭтаФорма.Параметры.Документ);
	Сформировать(Неопределено);   	
	КонецЕсли;
КонецПроцедуры
